
%首先，从 Excel 文件中读取数据并存储在变量 X 中。数据包括三列，分别是 GDP 值、人口数量和人均 GDP。
clc;clear;
%data = readmatrix('E:\日常\gdp.xlsx');
X = [124369	129119	30178.2
116364	122876	29401.7
83095	87435	20411
73516	77715	18925
58887	61345.1	14969
53850	56749.8	13374.7
50012	53734.9	11899.7
48810	53109.9	12061.9
46063	48670.4	11659.8
42959	45045	10936.2
40391	42370.4	10041.4
29800	32772.7	7651.9
29619	32074.7	7320.7
27584	28975.1	6661.4
27146	28954.2	6852.16
24740	26300.9	6250.83
22590	25642.6	5824.33
20514	23159	5344
19586	20164.6	4939.77
16000	17741.3	4149.52
14879	15901	3104.4
13235	13070.2	2833.88
10243	11201.6	2670.7
6475	6818.22	1775.96
4522	5069.57	1206.76
3346	3610.1	888.93
2000	2134.62	575.87
];
x=X;
%获取数据矩阵的行数和列数，并初始化一些变量。
 [m,n]=size(x);
 lunkuo=ones(1,m);
 julei=ones(m);
%循环遍历不同的聚类数量，从 1 到数据点的数量。
for k=1: m
    % 调用kmeans函数进行聚类分析
    % 这里我分别计算了k从1-27的值，是为了得出所有的聚类结果和轮廓系数
    % 当然，最后我进行根据最优k值进行选择我要的数据
    [idx, centers] = kmeans(x, k);
    % 计算每个数据点的轮廓系数，并求其平均值。
    s = silhouette(x,idx,'Euclidean');
    mean_s = mean(s);
    % 将平均轮廓系数保存到向量 lunkuo 中。
    lunkuo(1,k)=mean_s;
    %每一列对应一个聚类簇，将每个数据点的聚类结果保存到矩阵 julei 中。
    julei(:,k)=idx;
end
% 绘制k值与轮廓系数的折线图
k_values = 1:m; % k值范围从1到数据点数量
plot(k_values, lunkuo, 'bo-');
xlabel('Number of clusters (k)');
ylabel('Average silhouette score');
title('Silhouette analysis for k-means clustering');
grid on;
